package bcf;

import beast.core.Description;

@Description("Specific sound-class model for the creation of consonant vowel templates."
		+ "Sourced from lingpy/data/models/cv.")
public class CVScore extends Score {

	public CVScore() {
		/*+*/ process(0,"+, ·, ◦");
		/*_*/ process(0,"_, #");
		// vowels
		/*V*/ process(2,"a, ᴀ, ã, ɑ, á, à, ā, ǎ, ụ, ū, â, ɛ, æ, ɜ, ɐ, ʌ, e, ᴇ, ə, ẽ, ɘ, ɤ, è, é, ē, ě, ê, ɚ, Œ, ɒ, œ, ɞ, ɔ, ø, ɵ, o, õ, ó, ò, ō, ô, y, ṳ, ʏ, ʉ, u, ᴜ, ʊ, i, ɪ, ɨ, ɿ, ʅ, ɯ, ĩ, í, ǐ, ì, î, ī, ɶ, ɷ, ı, ǝ, ǒ, ĭ, ŏ, ẽ, ä, ö, ǒ, ĭ, ŏ, ŭ, ў, ă, ĕ, ü, ú, ũ, ṵ, ʮ, ɩ, ỹ, ε, ù, е, ï, ǔ, ạ, ụ, ọ, ỳ, ȯ, û, а, ę, û, ị, ý, å, ǫ, ë, ạ, ḭ, ḛ, ๅ, ố, ᴇ, ȇ, ȗ, ε, ṍ, ṹ, ṳ, ŷ, ʯ");
		// tonal?
		/*T*/ process(3,"₁₁, ₂₂, ¹¹, ²², ₁₂, ₁₃, ₁₄, ₁₅, ₂₃, ₂₄, ₂₅, ₃₄, ₃₅, ₄₅, ¹², ¹³, ¹⁴, ¹⁵, ²³, ²⁴, ²⁵, ³⁵, ³⁴, ⁴⁵, ₅₁, ₅₂, ₅₃, ₅₄, ₄₃, ₄₂, ₄₁, ₃₂, ₃₁, ₂₁, ⁵¹, ⁵², ⁵³, ⁵⁴, ⁴¹, ⁴², ⁴³, ³¹, ³², ²¹, ₃₃, ³³, ₄₄, ₅₅, ⁵⁵, ⁴⁴, ⁰, ¹, ², ³, ⁴, ⁵, ⁻, ₁, ₂, ₃, ₄, ₅, ₆, ₀, ˥, ˦, ˨, ˧");
		// consonants
		/*C*/ process(4,"ʆ, t͡s, t͜s, d͡z, d͜z, ʦ, ʣ, t͡ɕ, t͜ɕ, d͡ʑ, d͜ʑ, ʨ, ʥ, t͡ʃ, ʄ, t͜ʃ, d͡ʒ, d͜ʒ, ʧ, ʤ, c, ɟ, t͡ʂ, t͜ʂ, d͡ʐ, d͜ʐ, č, t͡θ, t͜θ, k, g, q, ɢ, ɡ, x, ɣ, χ, ǰ, ĵ, ḳ, ǥ, ǵ, ḡ, t͡ʂ, Ɉ, ʈʂ, ɖʐ, ʈʂʰ, tɕ, tɕʰ, dʑ, ts, dz, tsʰ, ɸ, β, f, p͡f, p͜f, ƀ, p, b, ɓ, р, ᵐb, ᵐp, ḇ, bv, b͡v, pf, ʔ, ħ, ʕ, h, ɦ, ḥ, Ɂ, ʡ, 'ʷ, j, ɥ, ɰ, m, ɱ, ʍ, ṃ, n, ȵ, ɳ, ŋ, ɴ, ň, ń, ɲ, ∼, ṇ, ñ, ῃ, ņ, ṋ, ɴ, s, z, ∫, ʃ, ʒ, ʂ, ʐ, ç, ʝ, š, ž, ɕ, ʑ, ɧ, ś, ṣ, ß, ŝ, ż, ẓ, ɹ, ɻ, ʀ, ɐ̯, ɾ, r, ʁ, ɽ, l, ȴ, l, ɭ, ʎ, ʟ, ɬ, ɮ, ɫ, ł, ɺ, ḷ, ṛ́, ṛ, ļ, ᵲ, ř, ȓ, ṙ, t, d, ȶ, ȡ, ɗ, ʈ, ɖ, θ, ð, ŧ, þ, đ, т, ṱ, ṭ, ḍ, ḏ, ţ, Ɵ, w, ʋ, v, ʙ, ⱱ, ṿ, ṽ, υ, ǃ, ǂ, ǁ, ǀ, ʘ, gǃ, gǂ, gǁ, gǀ, gʘ, ǃŋ, ǂŋ, ǁŋ, ǀŋ, ʘŋ, !, |, g!, g|, !ŋ, |ŋ, ƫ, ᶁ, ᶅ, ᶇ, ᶉ, ᶊ, ᶎ, ɠ, ʛ");
	setScore(new double[][] {
		/*+*/{       0.00    ,-100.00 ,-100.00 ,-100.00 ,-100.00},
		/*_*/{       -100.00 ,1.00    ,-100.00 ,-100.00 ,-100.00},
		/*V*/{       -100.00 ,-100.00 ,10.00   ,-100.00 ,-100.00},
		/*T*/{       -100.00 ,-100.00 ,-100.00 ,10.00   ,-100.00},
		/*C*/{       -100.00 ,-100.00 ,-100.00 ,-100.00 ,10.00}
		});
	}

}
